app/views/articles/index.html.erb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", nil]]
---
            <li>
           <%= link_to Article.find(popular_id[0]).title, article_path(Article.find(popular_id[0]).id) %>